Repository: darviarush/perl-aion-ray
Catalog: i18n/Liveman.*.po
Languages: ru_en

source: Liveman - markdown компиллятор в тесты и документацию
ru_en: Liveman - markdown compiler into tests and documentation

source: Файл lib/Example.md:
ru_en: File lib/Example.md:

source: Тест:
ru_en: Test:

source: Проблема современных проектов в том, что документация оторвана от тестирования. Это значит, что примеры в документации могут не работать, а сама документация может отставать от кода. Liveman компилирует файлы `lib/**`.md в файлы `t/**.t` и добавляет документацию в раздел `__END__` модуля к файлам `lib/**.pm`. Используйте команду `liveman` для компиляции документации к тестам в каталоге вашего проекта и запускайте тесты: liveman Запустите его с покрытием. Опция `-o` отрывает отчёт о покрытии кода тестами в браузере (файл отчёта покрытия: `cover_db/coverage.html`). Liveman заменяет `our $VERSION = "...";` в `lib/**.pm` из `lib/**.md` если он существует в личке и в md. Если файл **minil.toml** существует, то Liveman прочитает из него `name` и скопирует файл с этим именем и расширением `.md` в README.md.
ru_en: The problem with modern projects is that documentation is divorced from testing. This means that the examples in the documentation may not work, and the documentation itself may lag behind the code. Liveman compiles `lib/**`.md files into `t/**.t` files and adds documentation in the module's `__END__` section to the `lib/**.pm` files. Use the `liveman` command to compile test documentation in your project directory and run the tests: liveman Run it coated. The `-o` option opens the test code coverage report in the browser (coverage report file: `cover_db/coverage.html`). Liveman replaces `our $VERSION = "...";` in `lib/**.pm` from `lib/**.md` if it exists in PM and in md. If the **minil.toml** file exists, then Liveman will read `name` from it and copy the file with that name and `.md` extension into README.md.

source: Коды секций без указанного языка программирования или с `perl` записываются как код в файл `t/**.t`. А комментарий со стрелкой (# -> )превращается в тест `Test::More`.
ru_en: Section codes without a specified programming language or with `perl` are written as code in the file `t/**.t`. And a comment with an arrow (# -> ) turns into a `Test::More` test.

source: Сравнить два эквивалентных выражения:
ru_en: Compare two equivalent expressions:

source: Сравнить два выражения для структур:
ru_en: Compare two expressions for structures:

source: Сравнить выражение с экстраполированной строкой:
ru_en: Compare expression with extrapolated string:

source: Сравнить выражение с неэкстраполированной строкой:
ru_en: Compare an expression with a non-extrapolated string:

source: Проверяет регулярное выражение, включенное в выражение:
ru_en: Tests the regular expression included in the expression:

source: Он проверяет регулярное выражение, исключённое из выражения:
ru_en: It checks the regular expression excluded from the expression:

source: Каждый тест выполняется во временном каталоге, который удаляется и создается при запуске теста. Формат этого каталога: /tmp/.liveman/*project*/*path-to-test*/. Раздел кода в строке с префиксом md-файла **File `path`:** запись в файл при тестировании во время выполнения. Раздел кода в префиксной строке md-файла **File `path` is:** будет сравниваться с файлом методом `Test::More::is`. Файл experiment/test.txt:
ru_en: Each test runs in a temporary directory, which is deleted and created when the test runs. The format of this directory is /tmp/.liveman/*project*/*path-to-test*/. Section of code on line with md file prefix **File `path`:** write to file when testing at runtime. The code section in the md file prefix line **File `path` is:** will be compared to the file using the `Test::More::is` method. File experiment/test.txt:

source: Файл experiment/test.txt является:
ru_en: The experiment/test.txt file is:

source: **Внимание!** Пустая строка между префиксом и кодом не допускается! Эти префиксы могут быть как на английском, так и на русском.
ru_en: **Attention!** An empty line between the prefix and the code is not allowed! These prefixes can be in both English and Russian.

source: Конструктор. Имеет аргументы: 1. `files` (array_ref) — список md-файлов для методов `transforms` и `tests`. 1. `open` (boolean) — открыть покрытие в браузере. Если на компьютере установлен браузер **opera**, то будет использоватся команда `opera` для открытия. Иначе — `xdg-open`. 1. `force_compile` (boolean) — не проверять время модификации md-файлов. 1. `options` — добавить параметры в командной строке для проверки или доказательства. 1. `prove` — использовать доказательство (команду `prove` для запуска тестов), а не команду `yath`.
ru_en: Constructor. Has arguments: 1. `files` (array_ref) - list of md files for the `transforms` and `tests` methods. 1. `open` (boolean) — open the coverage in the browser. If the **opera** browser is installed on your computer, the `opera` command will be used to open it. Otherwise - `xdg-open`. 1. `force_compile` (boolean) - do not check the modification time of md files. 1. `options` - add parameters on the command line for verification or proof. 1. `prove` - use proof (the `prove` command to run tests), rather than the `yath` command.

source: Получить путь к `t/**.t`-файлу из пути к `lib/**.md`-файлу:
ru_en: Get the path to the `t/**.t` file from the path to the `lib/**.md` file:

source: Компилирует `lib/**.md`-файл в `t/**.t`-файл. А так же заменяет **pod**-документацию в секции `__END__` в `lib/**.pm`-файле и создаёт `lib/**.pm`-файл, если тот не существует. Файл lib/Example.pm является:
ru_en: Compiles a `lib/**.md` file into a `t/**.t` file. It also replaces the **pod** documentation in the `__END__` section in the `lib/**.pm` file and creates a `lib/**.pm` file if it does not exist. The lib/Example.pm file is:

source: Файл `lib/Example.pm` был создан из файла `lib/Example.md`, что описано в разделе `SINOPSIS` в этом документе.
ru_en: The file `lib/Example.pm` was created from the file `lib/Example.md`, as described in the `SINOPSIS` section of this document.

source: Компилировать `lib/**.md`-файлы в `t/**.t`-файлы. Все, если `$self->{files}` не установлен, или `$self->{files}`.
ru_en: Compile `lib/**.md` files into `t/**.t` files. All if `$self->{files}` is not set, or `$self->{files}`.

source: Запустить тесты (`t/**.t`-файлы). Все, если `$self->{files}` не установлен, или `$self->{files}` только.
ru_en: Run tests (`t/**.t` files). All if `$self->{files}` is not set, or `$self->{files}` only.

source: Проблема современных проектов в том, что документация оторвана от тестирования. Это значит, что примеры в документации могут не работать, а сама документация может отставать от кода. Liveman компилирует файлы `lib/**.md` в файлы `t/**.t` и добавляет документацию в раздел `__END__` модуля к файлам `lib/**.pm`. Используйте команду `liveman` для компиляции документации к тестам в каталоге вашего проекта и запускайте тесты: liveman Запустите его с покрытием. Опция `-o` открывает отчёт о покрытии кода тестами в браузере (файл отчёта покрытия: `cover_db/coverage.html`). Liveman заменяет `our $VERSION = "...";` в `lib/**.pm` из `lib/**.md` из секции **VERSION** если она существует. Если файл **minil.toml** существует, то Liveman прочитает из него `name` и скопирует файл с этим именем и расширением `.md` в `README.md`. Если нужно, чтобы документация в `*.md` была написана на одном языке, а `pod` – на другом, то в начале `*.md` нужно указать `!from:to` (с какого на какой язык перевести, например, для этого файла: `!ru:en`).
ru_en: The problem with modern projects is that documentation is divorced from testing. This means that the examples in the documentation may not work, and the documentation itself may lag behind the code. Liveman compiles `lib/**.md` files into `t/**.t` files and adds documentation in the module's `__END__` section to the `lib/**.pm` files. Use the `liveman` command to compile test documentation in your project directory and run the tests: liveman Run it coated. The `-o` option opens a code coverage report by tests in the browser (coverage report file: `cover_db/coverage.html`). Liveman replaces `our $VERSION = "...";` in `lib/**.pm` from `lib/**.md` from the **VERSION** section if it exists. If the **minil.toml** file exists, then Liveman will read `name` from it and copy the file with that name and `.md` extension into `README.md`. If you need the documentation in `*.md` to be written in one language, and `pod` in another, then at the beginning of `*.md` you need to indicate `!from:to` (from which language to translate, for example , for this file: `!ru:en`).

source: Каждый тест выполняется во временном каталоге, который удаляется и создается при запуске теста. Формат этого каталога: /tmp/.liveman/*project*/*path-to-test*/. Раздел кода в строке с префиксом md-файла **File `path`:** запишется в файл при тестировании во время выполнения. Раздел кода в префиксной строке md-файла **File `path` is:** будет сравниваться с файлом методом `Test::More::is`. Файл experiment/test.txt:
ru_en: Each test runs in a temporary directory, which is deleted and created when the test runs. The format of this directory is /tmp/.liveman/*project*/*path-to-test*/. The section of code on the line with the md file prefix **File `path`:** will be written to a file when tested at runtime. The code section in the md file prefix line **File `path` is:** will be compared to the file using the `Test::More::is` method. File experiment/test.txt:

source: Проблема современных проектов в том, что документация оторвана от тестирования. Это значит, что примеры в документации могут не работать, а сама документация может отставать от кода. Liveman компилирует файлы `lib/**.md` в файлы `t/**.t` и добавляет документацию в раздел `__END__` модуля к файлам `lib/**.pm`. Используйте команду `liveman` для компиляции документации к тестам в каталоге вашего проекта и запускайте тесты: liveman Запустите его с покрытием. Опция `-o` открывает отчёт о покрытии кода тестами в браузере (файл отчёта покрытия: `cover_db/coverage.html`). Liveman заменяет `our $VERSION = "...";` в `lib/**.pm` из `lib/**.md` из секции **VERSION** если она существует. Если файл **minil.toml** существует, то Liveman прочитает из него `name` и скопирует файл с этим именем и расширением `.md` в `README.md`. Если нужно, чтобы документация в `.md` была написана на одном языке, а `pod` – на другом, то в начале `.md` нужно указать `!from:to` (с какого на какой язык перевести, например, для этого файла: `!ru:en`). Файлы с переводами складываются в каталог `i18n`, например, `lib/My/Module.md` -> `i18n/My/Module.ru-en.po`. Перевод осуществляется утилитой `trans` (она должна быть установлена в системе). Файлы переводов можно подкорректировать, так как если перевод уже есть в файле, то берётся он.
ru_en: The problem with modern projects is that documentation is divorced from testing. This means that the examples in the documentation may not work, and the documentation itself may lag behind the code. Liveman compiles `lib/**.md` files into `t/**.t` files and adds documentation in the module's `__END__` section to the `lib/**.pm` files. Use the `liveman` command to compile test documentation in your project directory and run the tests: liveman Run it coated. The `-o` option opens a code coverage report by tests in the browser (coverage report file: `cover_db/coverage.html`). Liveman replaces `our $VERSION = "...";` in `lib/**.pm` from `lib/**.md` from the **VERSION** section if it exists. If the **minil.toml** file exists, then Liveman will read `name` from it and copy the file with that name and `.md` extension into `README.md`. If you need the documentation in `.md` to be written in one language, and `pod` in another, then at the beginning of `.md` you need to indicate `!from:to` (from which language to translate, for example, for this file: `!ru:en`). Files with translations are stored in the `i18n` directory, for example, `lib/My/Module.md` -> `i18n/My/Module.ru-en.po`. Translation is carried out using the `trans` utility (it must be installed on the system). Translation files can be corrected, because if the translation is already in the file, then it is taken.
